/**
 * @module 协议
 */
const style = {
  textIndent: '2em',
};
export default () => (
  <div>
    <p>
      注意：在使用本网站之前，请先认真阅读以下条款。使用本网站即表示您已接受这些条款。如果您不接受这些条款，请不要使用本网站。
    </p>
    <p>一、网站的使用</p>
    <p style={style}>
      只要您在任何材料副本上保留本网站（简称"本站"）原材料中包含的所有版权或其它所有权声明，蓝瓴信息科技（上海）有限公司（简称"蓝瓴"）将授权您查看和下载本站上的材料。该材料包括但不限于本站上的软件、文件、消息、信息等，但该材料只能用于私人的非商业用途。您不得以任何方式修改本站上的材料，不得复制或公开展示、执行或分发这些材料，或是用于任何公开目的或商业目的，亦不得为任何目的在任何其它网站或联网的计算机环境中使用这些材料。蓝瓴对本站上的材料均拥有知识产权，如果未经授权使用本站上的任何材料，您可能会违反著作权法、商标法和其它法律。如果您违反了本声明所述任何条款，您使用本站上的材料的授权将自动终止，您必须立即销毁所有下载或打印的本站上的材料。
    </p>
    <p>二、软件的使用</p>
    <p style={style}>
      本站中任何可供下载及使用的软件（以下简称＂该软件″）全部权利均为蓝瓴所有。任何对该软件的使用必须受到软件许可协议中许可条款及其他您与蓝瓴所订之相关软件许可协议（以下简称“许可协议”）之限制。
    </p>
    <p>三、适用法律和管辖</p>
    <p style={style}>
      本声明条款适用于中华人民共和国法律并依照中华人民共和国法律解释，任何与使用本站及本站材料相关的纠纷均应提交位于上海市的有管辖权的人民法院依据中华人民共和国法律诉讼解决。
    </p>
    <p>[蓝瓴公司版权所有，未经许可，禁止复制、链接或建立镜像]</p>
  </div>
);
